[
  {
    "company": "Netflix",
    "icon": "📺",
    "title": "Performance em Smart TVs - 200M+ usuários",
    "challenge": "O app React da Netflix rodava extremamente lento em Smart TVs antigas com hardware limitado (1GB RAM, processadores fracos). Usuários esperavam até 30 segundos para o app abrir e navegar entre categorias era praticamente impossível, causando frustração e cancelamentos em massa.",
    "solution": "Desenvolveram uma arquitetura de renderização assíncrona que carrega apenas o conteúdo visível na tela. Implementaram pré-rendering adaptativo que detecta a capacidade do dispositivo e ajusta a qualidade do streaming e interface automaticamente. Criaram um sistema de cache inteligente que funciona offline.",
    "practices": [
      "renderização por lote",
      "SSR parcial",
      "foco no device",
      "cache inteligente"
    ],
    "results": [
      "Redução de 70% no tempo até primeira interação",
      "Suporte a 200+ milhões de dispositivos diferentes",
      "99.9% de uptime durante eventos críticos"
    ],
    "link": "https://github.com/andrew--r/frontend-case-studies#netflix",
    "color": "red"
  },
  {
    "company": "Spotify",
    "icon": "🎧",
    "title": "Web Player com micro frontends - 500M+ usuários",
    "challenge": "O web player do Spotify tinha um bundle JavaScript gigante (mais de 5MB) que demorava muito para carregar. Qualquer mudança no código afetava toda a aplicação, tornando deploys arriscados e desenvolvimento lento. Usuários abandonavam o site antes mesmo de ouvir a primeira música.",
    "solution": "Adotaram micro frontends, dividindo o app em módulos independentes (player, playlist, busca, etc.). Cada módulo pode ser desenvolvido, testado e deployado separadamente. Implementaram lazy loading inteligente e cache de áudio otimizado.",
    "practices": [
      "modularização",
      "boundaries bem definidos",
      "lazy load",
      "cache de áudio"
    ],
    "results": [
      "Redução de 60% no bundle size inicial",
      "Tempo até o primeiro play caiu em 40%",
      "Suporte a 500+ milhões de usuários simultâneos"
    ],
    "link": "https://github.com/andrew--r/frontend-case-studies#spotify",
    "color": "green"
  },
  {
    "company": "Airbnb",
    "icon": "🏠",
    "title": "Imagens otimizadas com LQIP - 150M+ usuários",
    "challenge": "O site da Airbnb tinha páginas que demoravam mais de 8 segundos para carregar devido ao peso das imagens. Os usuários abandonavam a página antes mesmo de ver o conteúdo, causando perda significativa de conversões. O problema era especialmente crítico em dispositivos móveis e conexões lentas.",
    "solution": "Implementaram Low Quality Image Placeholders (LQIP) - imagens de baixa qualidade (2-5KB) que carregam instantaneamente enquanto as imagens de alta qualidade carregam em background. Combinaram com lazy loading inteligente e compressão adaptativa baseada na velocidade da conexão do usuário.",
    "practices": [
      "lazy loading",
      "progressive enhancement",
      "build otimizado",
      "compressão adaptativa"
    ],
    "results": [
      "Redução de 3.5s no tempo de carregamento",
      "Aumento de 10% na permanência dos usuários",
      "Suporte a 150+ milhões de usuários mensais"
    ],
    "link": "https://github.com/andrew--r/frontend-case-studies#airbnb",
    "color": "pink"
  },
  {
    "company": "Pinterest",
    "icon": "📌",
    "title": "PWA que virou case de sucesso - 450M+ usuários",
    "challenge": "O site mobile do Pinterest tinha bounce rate de 23% - usuários abandonavam a página antes mesmo de ver o conteúdo. O carregamento era lento, as imagens demoravam para aparecer e a navegação era confusa em dispositivos móveis. Perdiam milhões em receita por performance ruim.",
    "solution": "Reconstruíram totalmente o site mobile usando PWA com React. Implementaram service workers para cache inteligente, virtual scrolling para milhares de pins e lazy loading de imagens que carrega apenas o que está visível na tela. Criaram um sistema de compressão de imagens automático.",
    "practices": [
      "service workers",
      "virtual scrolling",
      "image lazy loading",
      "compressão automática"
    ],
    "results": [
      "Redução de 40% no tempo de carregamento",
      "Aumento de 44% na receita gerada por usuário",
      "Redução de 60% no tempo até primeira interação",
      "Suporte a 450+ milhões de usuários mensais"
    ],
    "link": "https://github.com/andrew--r/frontend-case-studies#pinterest",
    "color": "red"
  },
  {
    "company": "Tinder",
    "icon": "💘",
    "title": "React Native + performance crítica - 75M+ usuários",
    "challenge": "O app do Tinder travava durante swipes rápidos e o scroll infinito de perfis causava crashes frequentes. Em momentos de pico (noites de sexta), o app ficava praticamente inutilizável, causando perda de usuários para concorrentes. Performance era crítica para o negócio.",
    "solution": "Otimizaram a renderização usando FlatList do React Native com memoização inteligente. Implementaram lazy loading de perfis que carrega apenas 10-15 perfis por vez e otimizaram os gestos de swipe para responder instantaneamente. Criaram um sistema de cache de imagens otimizado.",
    "practices": [
      "virtual scrolling",
      "image caching",
      "gesture optimization",
      "memoização inteligente"
    ],
    "results": [
      "Redução de 30% no tempo de resposta do swipe",
      "Diminuição de 25% nos crashes de performance",
      "Aumento de 15% no tempo de sessão",
      "Suporte a 75+ milhões de usuários ativos"
    ],
    "link": "https://github.com/andrew--r/frontend-case-studies#tinder",
    "color": "pink"
  },
  {
    "company": "Slack",
    "icon": "💬",
    "title": "Desktop app com Electron otimizado - 12M+ usuários",
    "challenge": "O app desktop do Slack consumia mais de 500MB de RAM mesmo com poucos canais abertos. A busca de mensagens era extremamente lenta e o app travava frequentemente, especialmente em máquinas com recursos limitados. Usuários reclamavam constantemente da lentidão.",
    "solution": "Implementaram lazy loading de canais que carrega apenas os canais ativos, virtualização de mensagens que renderiza apenas as visíveis na tela e otimização de bundle que carrega funcionalidades sob demanda. Criaram um sistema de cache de mensagens inteligente.",
    "practices": [
      "code splitting",
      "virtual scrolling",
      "memory management",
      "cache inteligente"
    ],
    "results": [
      "Redução de 50% no uso de memória",
      "Melhoria de 35% na velocidade de busca",
      "Diminuição de 60% nos travamentos",
      "Suporte a 12+ milhões de usuários ativos"
    ],
    "link": "https://github.com/andrew--r/frontend-case-studies#slack",
    "color": "violet"
  },
  {
    "company": "Uber",
    "icon": "🚗",
    "title": "Maps em tempo real sem travar - 100M+ usuários",
    "challenge": "O mapa do Uber travava quando havia muitos motoristas na região (centenas de pins simultâneos) e as atualizações em tempo real causavam lag extremo. Usuários desistiam de pedir corrida devido à lentidão da interface. Performance era crítica para o negócio.",
    "solution": "Desenvolveram um canvas customizado para renderização do mapa em vez de usar APIs padrão. Implementaram clustering inteligente que agrupa motoristas próximos e debounce de updates que evita renderizações desnecessárias. Criaram um sistema de otimização de geolocalização.",
    "practices": [
      "canvas rendering",
      "clustering",
      "websocket optimization",
      "geolocalização otimizada"
    ],
    "results": [
      "Redução de 70% no tempo de renderização do mapa",
      "Capacidade de exibir 10x mais motoristas sem lag",
      "Diminuição de 45% na taxa de abandono durante o pedido",
      "Suporte a 100+ milhões de usuários ativos"
    ],
    "link": "https://github.com/andrew--r/frontend-case-studies#uber",
    "color": "indigo"
  },
  {
    "company": "WhatsApp Web",
    "icon": "💬",
    "title": "Chat em tempo real para 2 bilhões - 2B+ usuários",
    "challenge": "O WhatsApp Web precisava sincronizar mensagens entre mobile e web sem conflitos, funcionar offline e manter a performance mesmo com milhões de usuários simultâneos. Qualquer delay ou perda de mensagem era inaceitável. Escalabilidade era crítica.",
    "solution": "Implementaram arquitetura event-driven com reconciliação inteligente. O sistema funciona offline-first, armazenando mensagens em queue local e sincronizando quando há conexão, garantindo que nenhuma mensagem seja perdida. Criaram um sistema de criptografia end-to-end otimizado.",
    "practices": [
      "event sourcing",
      "offline sync",
      "optimistic updates",
      "criptografia E2E"
    ],
    "results": [
      "99.9% de sincronização sem perda de mensagens",
      "Funciona offline com queue de mensagens",
      "Tempo de abertura de chat reduzido em 40%",
      "Suporte a 2+ bilhões de usuários ativos"
    ],
    "link": "https://github.com/andrew--r/frontend-case-studies#whatsapp",
    "color": "green"
  },
  {
    "company": "Zoom",
    "icon": "📹",
    "title": "Web client que compete com desktop - 300M+ usuários",
    "challenge": "O Zoom Web tinha qualidade de vídeo inferior ao app desktop, delay alto e limitações de participantes. Empresas preferiam usar o app desktop mesmo em reuniões web, causando confusão e problemas de compatibilidade. Performance era crítica para o negócio.",
    "solution": "Otimizaram WebRTC com canvas customizado para processamento de vídeo e worker threads para não bloquear a interface. Implementaram compressão adaptativa que ajusta qualidade baseada na conexão do usuário. Criaram um sistema de otimização de áudio em tempo real.",
    "practices": [
      "webrtc optimization",
      "canvas processing",
      "web workers",
      "compressão adaptativa"
    ],
    "results": [
      "Qualidade de vídeo equivalente ao app desktop",
      "Redução de 30% no delay de vídeo",
      "Suporte a 1000+ participantes no browser",
      "Suporte a 300+ milhões de usuários mensais"
    ],
    "link": "https://github.com/andrew--r/frontend-case-studies#zoom",
    "color": "blue"
  },
  {
    "company": "Figma",
    "icon": "🎨",
    "title": "Editor vetorial 100% web - 4M+ usuários",
    "challenge": "Criar um editor gráfico complexo como Photoshop rodando no browser parecia impossível. Figma precisava de performance equivalente a softwares nativos para renderizar arquivos com milhares de layers e suportar colaboração em tempo real. Performance era crítica para o negócio.",
    "solution": "Combinaram WebGL para renderização acelerada, WebAssembly para processamento pesado e arquitetura multiplayer real-time. O editor funciona 100% no browser sem necessidade de instalação, mantendo performance nativa. Criaram um sistema de otimização de vetores.",
    "practices": [
      "webgl rendering",
      "wasm optimization",
      "real-time collaboration",
      "otimização de vetores"
    ],
    "results": [
      "Performance equivalente a softwares nativos",
      "Colaboração em tempo real sem conflitos",
      "Renderização de arquivos com 1000+ layers sem lag",
      "Suporte a 4+ milhões de usuários ativos"
    ],
    "link": "https://github.com/andrew--r/frontend-case-studies#figma",
    "color": "orange"
  },
  {
    "company": "Discord",
    "icon": "🎮",
    "title": "Chat gaming com baixíssima latência - 150M+ usuários",
    "challenge": "Discord precisava de latência de voz abaixo de 50ms para gamers e suporte a centenas de milhares de usuários simultâneos por servidor. Qualquer delay ou queda de conexão era inaceitável para a comunidade gaming. Performance era crítica para o negócio.",
    "solution": "Desenvolveram uma engine de voz customizada usando React + Rust (WebAssembly) para processamento de áudio e websockets otimizados para mensagens. A arquitetura suporta milhões de usuários simultâneos com latência mínima. Criaram um sistema de otimização de rede.",
    "practices": [
      "wasm integration",
      "websocket optimization",
      "audio processing",
      "otimização de rede"
    ],
    "results": [
      "Latência de voz abaixo de 50ms",
      "Suporte a 800.000 usuários simultâneos por servidor",
      "99.99% de uptime durante eventos críticos",
      "Suporte a 150+ milhões de usuários ativos"
    ],
    "link": "https://github.com/andrew--r/frontend-case-studies#discord",
    "color": "indigo"
  },
  {
    "company": "Google",
    "icon": "🎨",
    "title": "Teste A/B com 41 tons de azul - 1B+ usuários",
    "challenge": "Os botões de call-to-action (CTA) do Gmail tinham taxas de clique muito baixas, especialmente no botão \"Compose\" (escrever email). A equipe precisava descobrir qual cor geraria mais cliques sem afetar a usabilidade geral da interface. Conversão era crítica.",
    "solution": "Criaram um sistema de testes A/B que testou 41 variações diferentes do tom de azul do botão \"Compose\". Cada variação foi testada com milhões de usuários, coletando dados de cliques, tempo de permanência e satisfação do usuário. Implementaram análise de dados em tempo real.",
    "practices": [
      "cultura de experimentação",
      "foco em conversão",
      "análise de dados",
      "testes A/B"
    ],
    "results": [
      "Milhões de dólares em receita extra apenas ajustando o tom de azul",
      "Aumento significativo na taxa de cliques",
      "Suporte a 1+ bilhão de usuários ativos"
    ],
    "link": "https://github.com/andrew--r/frontend-case-studies#google",
    "color": "blue"
  },
  {
    "company": "Booking.com",
    "icon": "🛎️",
    "title": "Testes A/B constantes - 100M+ usuários",
    "challenge": "O site de reservas tinha conversão inconsistente - alguns fluxos funcionavam bem em desktop mas falhavam no mobile, outros tinham performance variável dependendo do país. Precisavam otimizar cada elemento da jornada do usuário de forma contínua.",
    "solution": "Implementaram uma cultura de testes A/B em todo o front-end, testando desde cores de botões até fluxos completos de reserva. Cada mudança passa por testes rigorosos antes de ir para produção, com métricas de conversão em tempo real. Criaram um sistema de otimização contínua.",
    "practices": [
      "feature toggles",
      "entrega contínua",
      "UX com métricas",
      "otimização contínua"
    ],
    "results": [
      "Melhorias marginais de 1~2% renderam milhões ao ano",
      "Aumento significativo na taxa de conversão",
      "Suporte a 100+ milhões de usuários mensais"
    ],
    "link": "https://github.com/andrew--r/frontend-case-studies#booking",
    "color": "orange"
  },
  {
    "company": "Twitter",
    "icon": "🐦",
    "title": "Twitter Lite com PWA - 400M+ usuários",
    "challenge": "O app mobile do Twitter consumia muito dados e era lento em redes 2G/3G, especialmente em países emergentes. Usuários abandonavam o app por consumir todo o pacote de dados ou por demorar muito para carregar tweets e imagens.",
    "solution": "Reconstruíram completamente o app usando PWA (Progressive Web App) com React. Implementaram service workers para cache inteligente, compressão de imagens automática e carregamento progressivo que funciona offline. Criaram um sistema de otimização de dados.",
    "practices": [
      "app shell",
      "lazy loading",
      "cache otimizado",
      "otimização de dados"
    ],
    "results": [
      "Redução de 70% no consumo de dados",
      "Aumento de 65% nas sessões por visitante",
      "Suporte a 400+ milhões de usuários ativos"
    ],
    "link": "https://github.com/andrew--r/frontend-case-studies#twitter",
    "color": "cyan"
  },
  {
    "company": "Walmart",
    "icon": "🛒",
    "title": "Black Friday com PWA - 200M+ usuários",
    "challenge": "O site mobile da Walmart travava completamente durante o Black Friday devido ao tráfego massivo. Usuários não conseguiam finalizar compras, imagens não carregavam e o carrinho de compras falhava constantemente, causando perda de milhões em vendas.",
    "solution": "Reconstruíram o site mobile usando React + PWA com foco em performance. Implementaram preload inteligente de produtos populares, design responsivo otimizado e bundle splitting que carrega apenas o necessário para cada página. Criaram um sistema de cache otimizado.",
    "practices": [
      "preload inteligente",
      "design responsivo",
      "otimização de bundle",
      "cache otimizado"
    ],
    "results": [
      "+98% de conversões no mobile",
      "-50% no tempo de carregamento",
      "Suporte a 200+ milhões de usuários mensais"
    ],
    "link": "https://github.com/andrew--r/frontend-case-studies#walmart-labs",
    "color": "yellow"
  },
  {
    "company": "GOV.UK",
    "icon": "🇬🇧",
    "title": "Design simples e acessível - 60M+ usuários",
    "challenge": "Os sites governamentais do Reino Unido eram confusos, lentos e inacessíveis. Cidadãos não conseguiam completar serviços básicos como renovar passaporte ou pagar impostos online, causando filas físicas e custos altos para o governo.",
    "solution": "Criaram um design system focado em clareza extrema, acessibilidade total (WCAG AAA) e performance. Cada página tem um objetivo único, linguagem simples e funciona perfeitamente em qualquer dispositivo, incluindo leitores de tela. Implementaram otimização de performance.",
    "practices": [
      "mobile-first",
      "conteúdo direto",
      "WCAG compliance",
      "otimização de performance"
    ],
    "results": [
      "Aumento na taxa de conclusão de serviços públicos online",
      "Notas altíssimas de acessibilidade",
      "Suporte a 60+ milhões de cidadãos"
    ],
    "link": "https://github.com/andrew--r/frontend-case-studies#govuk",
    "color": "grape"
  }
]
